In [ ]:
!pip install duckdb --quiet

In [ ]:
import duckdb

In [31]:
con = duckdb.connect()

In [32]:
# Create students table
con.execute("""
    CREATE TABLE students (
        student_id INT PRIMARY KEY,
        name VARCHAR,
        age INT,
        gender CHAR(1),
        enrollment_date DATE,
        program VARCHAR
    );
""")

In [33]:
con.execute("""
    INSERT INTO students VALUES
    (1, 'Alice Mwangi', 22, 'F', '2023-08-01', 'Computer Science'),
    (2, 'Brian Otieno', 24, 'M', '2022-01-15', 'Data Science'),
    (3, 'Caroline Wanjiku', 21, 'F', '2024-03-12', 'Business Administration'),
    (4, 'Daniel Kipkoech', 23, 'M', '2023-09-30', 'Information Technology'),
    (5, 'Eunice Auma', 20, 'F', '2024-02-05', 'Software Engineering');
""")

In [34]:
con.execute("SELECT * FROM students").df()

,student_id,name,age,gender,enrollment_date,program
0,1,Alice Mwangi,22,F,2023-08-01,Computer Science
1,2,Brian Otieno,24,M,2022-01-15,Data Science
2,3,Caroline Wanjiku,21,F,2024-03-12,Business Administration
3,4,Daniel Kipkoech,23,M,2023-09-30,Information Technology
4,5,Eunice Auma,20,F,2024-02-05,Software Engineering

In [35]:
con.execute("""
    SELECT * FROM students WHERE program = 'Data Science';
""").df()

   student_id          name  age gender enrollment_date       program
0           2  Brian Otieno   24      M      2022-01-15  Data Science

In [36]:
con.execute("""
    SELECT COUNT(*) AS "Total Students" FROM students;
""").df()

   Total Students
0               5

In [37]:
con.execute("""
    SELECT CURRENT_DATE AS "Today's Date";
""").df()

  Today's Date
0   2025-06-24

In [38]:
con.execute("""
    SELECT UPPER(name) AS name_uppercase, enrollment_date FROM students;
""").df()

     name_uppercase enrollment_date
0      ALICE MWANGI      2023-08-01
1      BRIAN OTIENO      2022-01-15
2  CAROLINE WANJIKU      2024-03-12
3   DANIEL KIPKOECH      2023-09-30
4       EUNICE AUMA      2024-02-05

In [ ]:
con.execute("""
    SELECT program, COUNT(*) AS "Number of Students"
    FROM students
    GROUP BY program
    ORDER BY "Number of Students" DESC;
""").df()

                   program  Number of Students
0  Business Administration                   1
1         Computer Science                   1
2     Software Engineering                   1
3             Data Science                   1
4   Information Technology                   1

In [ ]:
con.execute("""
    SELECT name, age FROM students
    WHERE age = (SELECT MIN(age) FROM students);
""").df()

          name  age
0  Eunice Auma   20